MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/M032BTAIAAN/mcu.h
#define GET_BYTE0(u32Param)    (((u32Param) & BYTE0_Msk)      ) /*!< Extract Byte 0 (Bit  0~ 7) from parameter u32Param */
#define GET_BYTE1(u32Param)    (((u32Param) & BYTE1_Msk) >>  8) /*!< Extract Byte 1 (Bit  8~15) from parameter u32Param */
#define GET_BYTE2(u32Param)    (((u32Param) & BYTE2_Msk) >> 16) /*!< Extract Byte 2 (Bit 16~23) from parameter u32Param */
#define GET_BYTE3(u32Param)    (((u32Param) & BYTE3_Msk) >> 24) /*!< Extract Byte 3 (Bit 24~31) from parameter u32Param */

/* Chip Series number definitions */
#define GET_CHIP_SERIES_NUM    ((SYS->PDID & 0xF00) >> 8)       /*!< Extract chip series number from PDID */
#define CHIP_SERIES_NUM_B      (0xBUL)                          /*!< Chip series number for M031_B */
#define CHIP_SERIES_NUM_C      (0xCUL)                          /*!< Chip series number for M031_C */
#define CHIP_SERIES_NUM_D      (0xDUL)                          /*!< Chip series number for M031_D */
#define CHIP_SERIES_NUM_E      (0xEUL)                          /*!< Chip series number for M031_E */
#define CHIP_SERIES_NUM_G      (0x6UL)                          /*!< Chip series number for M031_G */
#define CHIP_SERIES_NUM_I      (0x1UL)                          /*!< Chip series number for M031_I */

/*@}*/ /* end of group Legacy_Constants */

/******************************************************************************/
/*                         Peripheral header files                            */
/******************************************************************************/
// Note: Changed for MikroE implementation.
// #include "sys.h"
// Note: Changed for MikroE implementation.
// #include "clk.h"
// Note: Changed for MikroE implementation.
// #include "acmp.h"
// Note: Changed for MikroE implementation.
// #include "adc.h"
// Note: Changed for MikroE implementation.
// #include "crc.h"
// Note: Changed for MikroE implementation.
// #include "ebi.h"
// Note: Changed for MikroE implementation.
// #include "fmc.h"
// Note: Changed for MikroE implementation.
// #include "gpio.h"
// Note: Changed for MikroE implementation.
// #include "i2c.h"
// Note: Changed for MikroE implementation.
// #include "pdma.h"
// Note: Changed for MikroE implementation.
// #include "pwm.h"
// Note: Changed for MikroE implementation.
// #include "bpwm.h"
// Note: Changed for MikroE implementation.
// #include "qspi.h"
// Note: Changed for MikroE implementation.
// #include "spi.h"
// Note: Changed for MikroE implementation.
// #include "rtc.h"
// Note: Changed for MikroE implementation.
// #include "hdiv.h"
// Note: Changed for MikroE implementation.
// #include "timer.h"
// Note: Changed for MikroE implementation.
// #include "uart.h"
// Note: Changed for MikroE implementation.
// #include "usbd.h"
// Note: Changed for MikroE implementation.
// #include "usci_i2c.h"
// Note: Changed for MikroE implementation.
// #include "usci_spi.h"
// Note: Changed for MikroE implementation.
// #include "usci_uart.h"
// Note: Changed for MikroE implementation.
// #include "wdt.h"
// Note: Changed for MikroE implementation.
// #include "wwdt.h"

#endif  // __M031SERIES_H__

/* Copyright (C) 2018 Nuvoton Technology Corp. All rights reserved. */
